# Напишите программу с классом, в котором есть закрытое статическое
# целочисленное ноле с начальным нулевым значением. В классе должен быть описан
# статический метод, при вызове которого отображается текущее значение статического
# поля, после чего значение поля увеличивается на единицу.


class Lab6Ex2:

    clsField = 0


    def get_value(self):
        try:
            return self.clsField
        finally:
            self.clsField += 1


a = Lab6Ex2()


while True:
    userDecision = input("Введите Y для получения значения, или N для завершения: ").lower()

    if userDecision == 'y':
        print("Значение поля: ", a.get_value())
        userDecision = ''
        continue
    elif userDecision == 'n':
        break
    else:
        print("Введите корректное значение! (Y/N)")
        continue

# Немного переделал, т.к. метод по условию вызывается 1 раз, и инкремент поля не возможно увидеть.