# Напишите программу со статическим методом, которым вычисляется сумма
# квадратов натуральных чисел 1
# 2 + 22 + 32 + ... + п^2
# . Число п передается аргументом методу.
# Для проверки результата можно использовать формулу 12 + 22 +3 2+…+n 2= (n+l) (2n + 1)/6


class Lab6Ex5:


    @staticmethod
    def get_value(value):
        res = 0
        for i in range(1, value + 1):
            res = res + (i ** 2)
        return res


a = Lab6Ex5()
print(a.get_value(13))